# # print('Hello, World!')
# # Print(2025)

# # Операторы сравнения
# # > больше 
# # < мнеьше
# # >= больше или равно
# # <=мньше или равно
# # == равно
# # != не равно

# # Типы данных в Phayton
# # int-целые числа (1, 2, 3, -5, -10)
# # folat - числа с плавающей точкой (1.5, 2.75, -3.14)
# # str - строки (тест) ('Hello,' "World",
# # Boolean - True=1 и False=0 - ,булевы значения (логические)

# # Переменные это именованные ячейки памяти, которыее хранят в себе данные определенного типа.
 a = 10 # int
b = 2.5 # folat
c = 'Hello' # str
d = True # boolean (истина и ложь)
name = 'Adilet'
age =45

# # type () - функция, котора возвращает тип данных
# print(type(45-3.5))
# print(type(45-35))
# print(type(True))
# print(type('Hello'))
# print(int(5.5))
# print(float(6))
# print(int('5'))
# print(int(True))
# print(45+True)
# print(5*'Hello\n')









# # Типы данных
# # int - целые числа 10, -5, 100
# # float - числа с плавающей точкой 3.14, -0.5, 2.0
# # str - строки "Hello", 'world', "123"
# # bool - булевы значения (True, False)
# # list - списки [1, 2, 3], ['x', 'y', 'z]
# # tuple - кортежи (1, 2, 3), ('x', 'y', 'z',)
# # dict - словари {'key': 'value'}, {'name': 'alice', 'age' : 30}
# # set - множества {1, 2, 3}, {'a', 'b'}
# # None - специальный тип данных, обозначающий отсутсвие значения

# # Ввод и вывод данных
# # name = input("Введите ваше имя:")
# # age = input("Введите ваш возраст:")
# # learning = input("что вы изучаете:")
# # Like = input("что вам нравится:")
# # print("Привет," + name + " ! + age + "  "лет.")
# # print("Ты изучаешь  " +  learning  +  "и тебе нравится" + Like)

#  # Правила переменных
# #  Нельзя начинать название пременной с цифры 
# # 5number = 5 - не правильно 
# # 5 = 5 - неправильное 
# #  number_5 = 5 - правильно 
# # В названиях переменных разрешаются только буквы латинского алфавита, цифры и нижний пробел _
# # first_name = "Mark" - правильно
# # first.name = "Mark" - неправильно
# # Названия переменных должны четко указывать, что в них хранится или же иметь смысловую связь.
# # n = "Mark" - непонятно, что хранится в переменной 
# # name = "Mark" - правильно название
# # n = 5 неправильно 
# # num = 5  правильно 
# # number = 5 правильно 
# # Исползуем для отделения слов snake case 
# # название переменных не должно совподать с названием ключевых слов языка Python:
# False await     else import  pass
# None break except in raise
# True class finally is return
# and contine for lambda try
# as     def from nonlocal while 
# assert del global not with
# async    elif if or yield
# # num1, num2, num3 = 1, 2, 3 
# # print(num1)
# # # результат выполнения: 1 
# # print(num2)
# # # результат выполнения: 2 
# # print(num3)
# # # результат выполнения: 3
# # name, surname, age = "John", "Doe", 20
# #  print(name)
# # # результат выполнения: "John"
# #  print(surname)
# # # результат выполнения: "Dое"
# #  print(age)
# # н результат выполнения:20